posts/2020-06-15-org-links/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Even Better Emacs Org-Mode Links</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Even Better Emacs Org-Mode Links</h1>
</header><p>
In a <a href="../2019-01-30-emacs-orglink">previous blog post</a> I talked about how I am using org-mode links
to create shortcuts for accessing my projects. The outlined solution was using
link shortcuts with custom elisp code. While this is a valid solution, clicking
such a link prompts you for a "would you like to run this code?" confirmation,
which is annoying. There is a variable to avoid this popup, but using it is a
questionable decision regarding security. I'd rather not run (potentially) any
code when clicking on a link in an org-mode file.
</p>

<p>
I stumbled over <a href="http://kitchingroup.cheme.cmu.edu/blog/2016/11/04/New-link-features-in-org-9/">a post</a> about org-mode v9 (published in 2016) which contains a
lot of examples on what you can do with custom links. So here's my improved
setup:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun fw/open-git (path)
  "Opens magit and neotree at `path'"
  (neotree-dir path)
  (other-window 1)
  (magit-status path))

(org-add-link-type "git" 'fw/open-git)
</pre>
</div>

<p>
Which can be used like this:
</p>

<div class="org-src-container">
<pre class="src src-org">* [[git:D:/Projects/SomeProject][Some Project]]

** TODO Something Important
</pre>
</div>

<p>
These links are nothing groundbreaking, but I find them to be really convenient.
I can have a look at my TODO list and when I feel like tackling a particular
project, I just click the header to jump right into the action.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2020-06-15</p>
<footer>
<p>© 2026 Florian Winkelbauer</p>
</footer>
</div>
</body>
</html>
